import React from 'react';
import './privacyPolicy.css'; // Import your CSS file

const PrivacyPolicy = () => {
  return (
    <div className="privacy-policy">
      <h2>سياسة الخصوصية</h2>
      <p>أهلاً بك في سياسة الخصوصية لترجمان. نحن نولي أهمية كبيرة لحماية خصوصيتك وأمان معلوماتك الشخصية. يرجى قراءة هذه السياسة بعناية لفهم كيفية جمع واستخدام وحماية المعلومات التي تقدمها لنا.</p>
      
      <h3>1. المعلومات التي نجمعها:</h3>
      <ul>
        <li><span>المعلومات الشخصية:</span> قد نجمع معلومات شخصية منك، مثل الاسم وعنوان البريد الإلكتروني، عند تقديمك لخدماتنا.</li>
        <li><span>البيانات غير الشخصية:</span> يمكن أن نقوم بجمع بيانات غير شخصية ومجمعة تتعلق بالاستخدام العام للمنصة، مثل النمط العام للبحث واستخدام الميزات.</li>
      </ul>
      
      <h3>2. كيف نستخدم المعلومات:</h3>
      <ul>
        <li><span>تحسين الخدمات:</span> نستخدم المعلومات لتحسين خدماتنا وتجربة المستخدم، بما في ذلك تطوير وتحسين النماذج الذكاء الاصطناعي.</li>
        <li><span>التواصل معك:</span> قد نستخدم عنوان بريدك الإلكتروني للتواصل معك بشأن تحديثات المنصة أو خدماتنا.</li>
      </ul>

      <h3>3. مشاركة المعلومات:</h3>
      <ul>
        <li><span>مع شركاء الخدمات:</span> قد نشارك المعلومات مع شركاء الخدمات لتقديم الخدمات بشكل أفضل، ولكن بما يتماشى مع هذه السياسة والقوانين ذات الصلة.</li>
        <li><span>الامتثال للقوانين:</span> نحتفظ بالحق في الكشف عن المعلومات إذا كان ذلك مطلوبًا بموجب القانون أو للامتثال للإجراءات القانونية.</li>
      </ul>

      <h3>4. أمان المعلومات:</h3>
      <ul>
        <li><span>تأمين البيانات:</span> نتخذ إجراءات أمان قوية لحماية معلوماتك الشخصية من الوصول غير المصرح به أو الاستخدام أو التغيير أو الإفشاء.</li>
      </ul>

      <h3>5. الوصول لنموذج الذكاء الاصطناعي:</h3>
      <ul>
        <li><span>الاستخدام الخارجي:</span> نوفر وصولاً لنموذج الذكاء الاصطناعي للاستخدام خارج المنصة، ولكن يتم ذلك بموجب شروط وأحكام محددة تضمن الاستخدام الآمن والمسؤول لذلك النموذج.</li>        
      </ul>

      <h3>6. التغييرات في سياسة الخصوصية:</h3>
      <ul>
        <li><span>التحديثات:</span> نحتفظ بالحق في تحديث سياسة الخصوصية هذه بشكل دوري، وسيتم نشر أي تغييرات على هذه الصفحة مع تحديد تاريخ التحديث.</li>
      </ul>

      <h3>7. الموافقة:</h3>
      <ul>
        <li><span>موافقتك:</span> باستخدامك لمنصتنا وخدماتنا، فإنك توافق على جمع واستخدام معلوماتك بموجب سياسة الخصوصية هذه.</li>
      </ul>

      <p>يرجى التواصل معنا إذا كان لديك أي أسئلة حول سياسة الخصوصية الخاصة بنا. شكرًا لثقتك واستخدامك لمنصتنا.</p>
    </div>
  );
};

export default PrivacyPolicy;