import React from 'react';
import './intellectualProperty.css';

const TermsAndConditions = () => {
  return (
    <div className="terms-and-conditions">
      <h2>حقوق الملكية الفكرية</h2>
      <ol>
        <li><span>المحتوى والحقوق:</span> نحتفظ بجميع حقوق الملكية الفكرية لجميع المواد والمحتويات المقدمة على المنصة، بما في ذلك النصوص والصور والفيديوهات والبرمجيات.</li>
        <li><span>العلامات التجارية:</span> تعتبر العلامات التجارية المستخدمة على المنصة ملكية فكرية ويجب الامتثال لحقوقها، ويُمنع استخدامها دون إذن مسبق.</li>
        <li><span>نموذج الذكاء الاصطناعي:</span> نموذج الذكاء الاصطناعي الموجودة على المنصة ينتمي لنا ويخضع لحقوق الملكية الفكرية، ويجب الامتثال لشروط استخدامه.</li>
        <li><span>التصميم وواجهة المستخدم:</span> يتمتع تصميم المنصة وواجهة المستخدم بحماية حقوق الملكية الفكرية، ويُمنع نسخها أو استخدامها دون إذن.</li>
        <li><span>البرمجيات:</span> يعتبر البرمجيات المستخدمة في المنصة محمية بحقوق الملكية الفكرية، ويجب الامتثال للتراخيص وعدم توزيعها أو نسخها.</li>
        <li><span>المحتوى بإذن:</span> في حالة استخدام المحتوى الذي يتطلب إذنًا، يجب الامتثال لشروط الاستخدام المحددة وعدم التجاوز عن الاستخدام المسموح به.</li>
        <li><span>التسجيل والتوثيق:</span> قد يتم تسجيل وتوثيق بعض المواد أو المحتويات لضمان حماية حقوق الملكية الفكرية.</li>
        <li><span>الاستخدام الشرعي:</span> يجب استخدام المواد والمحتويات المقدمة على المنصة بطريقة تتفق مع القوانين والتشريعات السارية.</li>
        <li><span>الاستخدام التجاري:</span> يُمنع استخدام المحتوى أو النماذج أو البرمجيات لأغراض تجارية دون إذن مسبق.</li>
        <li><span>المسؤولية:</span> يتحمل المستخدم المسؤولية القانونية الكاملة عن أي انتهاك لحقوق الملكية الفكرية في حالة استخدامه غير المشروع للمواد أو المحتويات على المنصة.</li>
      </ol>
      <p>باستخدام المنصة، فإنك توافق على احترام والامتثال لحقوق الملكية الفكرية المذكورة أعلاه.</p>
    </div>
  );
};

export default TermsAndConditions;
