import React from 'react';
import './termsAndConditions.css'; // Import your CSS file

const TermsAndConditions = () => {
  return (
    <div className="terms-and-conditions">
      <h2>الشروط والأحكام</h2>
      <p>يرجى قراءة هذه الشروط والأحكام بعناية قبل استخدام منصتنا لاستخراج النصوص من الصور بالذكاء الاصطناعي. باستخدامك للخدمة، فإنك توافق على الالتزام بالشروط والأحكام التالية:</p>

      <ol>
        <li><span>الاستخدام الشخصي:</span> يجب استخدام خدمتنا لأغراض شخصية فقط. يُمنع استخدامها لأي غرض غير قانوني أو غير مصرح به.</li>
        <li><span>الملكية الفكرية:</span> جميع حقوق الملكية الفكرية المتعلقة بمنصتنا والخدمات المقدمة تنتمي إلى الشركة. يجب عدم نسخ أو توزيع أو نقل أو بيع أو استخدام أي جزء من المنصة دون إذن مسبق.</li>
        <li><span>التعويض:</span> يوافق المستخدم على تعويض الشركة وحمايتها من أي مطالبات أو خسائر أو أضرار (بما في ذلك الرسوم القانونية العادلة) ناتجة عن استخدامه للخدمة بطريقة تنتهك هذه الشروط والأحكام.</li>
        <li><span>تغيير الخدمة:</span> نحتفظ بالحق في تغيير أو إيقاف أو تعليق أو تعطيل أي جانب من جوانب الخدمة في أي وقت دون إشعار مسبق.</li>
        <li><span>التغييرات في الشروط والأحكام:</span> نحتفظ بالحق في تحديث أو تعديل هذه الشروط والأحكام في أي وقت، وسيتم نشر أي تغييرات على هذه الصفحة.</li>
        <li><span>القوانين السارية:</span> يخضع استخدامك لهذه الخدمة للقوانين والتشريعات السارية في القوانين ذات الصلة.</li>
        <li><span>إنهاء الخدمة:</span> نحتفظ بالحق في إنهاء خدمتنا لك في أي وقت بدون إشعار مسبق إذا لم تلتزم بالشروط والأحكام.</li>
      </ol>

      <p>باستخدامك لمنصتنا، فإنك توافق على الامتثال لهذه الشروط والأحكام. إذا كان لديك أي استفسارات أو مخاوف، يرجى التواصل معنا.</p>
    </div>
  );
};

export default TermsAndConditions;